Kaveri-B/contiki/cpu/arm/aducm3029/dev/telec_dev/aducm3029-ADF7023.c
/***********************************************************************************************************************

Copyright (c) 2013 - 2015, Analog Devices, Inc.  All rights reserved.

This software is proprietary to Analog Devices, Inc. and its licensors.  By using this software you agree
to the terms of the associated Analog Devices Software License Agreement.

***********************************************************************************************************************/
/*---------------------------------------------------------------------------*/
/**
* \file
*					Machine dependent ADucM3025 radio driver code.
* \author
*					Analog Devices
*/
/*---------------------------------------------------------------------------*/

#include <stdio.h>
#include <string.h>
#include <math.h>
#include <stddef.h>
#include <stdlib.h>
#include <stdbool.h>
#include <gpio\adi_gpio.h>
#include <uart\adi_uart.h>
//#include "uhf.h"
#include "utest_support.h"

#include "contiki.h"
#include "dev/radio.h"

#include "dev/aducm3029-radio.h"
#include "net/netstack.h"

#include "net/packetbuf.h"

#include "contiki-conf.h"

#include "system.h"
#include "telec_common.h"
#include "stack_support.h"
#include "ADF7023.h"
#include "trx_access.h"
#include "queue_latest.h"
#ifdef TELEC_TEST_HARNESS
#include "buff_mgmt.h"
#endif

#include "RF_Module_API_Handler.h"
#include "phy/phy.h"

#ifdef INTERACTIVE_SETTINGS
#define PRINTF(...) printf(__VA_ARGS__)
#else
#define PRINTF(...)
#endif

//#define DEBUG

#ifdef DEBUG
#define PRINTF_DEBUG(...)	printf(__VA_ARGS__)
#else
#define PRINTF_DEBUG(...)
#endif

#define CLEAN_RXBUF() (aducm3025_rxbuf[0] = 0)
#define RXBUF_EMPTY() (aducm3025_rxbuf[0] == 0)

#define CLEAN_TXBUF() (aducm3025_txbuf[0] = 0)
#define TXBUF_EMPTY() (aducm3025_txbuf[0] == 0)

/*----------------------------- Local Defines ---------------------------------*/

/* The transceiver state */
#define ON     0
#define OFF    1
#define MAC_MAX_ACK_RETRY       1

/* Toggle the macro below to turn various UHF interrupts on and off */
#define ADI_ADF7023_IMASK_CON \
INT_TX_EOF     |\
  INT_CRC_CORRECT

#ifndef DISABLE_PATCH_802_15_4D

#define PHR_FCS_LEN_BIT_RESET				0x00
#define PHR_FCS_LEN_BIT_SET				0x10
#define PHR_DATA_WHITENING_ENABLED			0x08
#define PHR_DATA_WHITENING_DISABLED			0x00

#else

#define PHR_FCS_LEN_BIT_RESET				0x0000
#define PHR_FCS_LEN_BIT_SET				0x0008
#define PHR_DATA_WHITENING_ENABLED			0x0010
#define PHR_DATA_WHITENING_DISABLED			0x0000

#endif // DISABLE_PATCH_802_15_4D

#ifdef TELEC_TEST_HARNESS
#define BUFFER_POOL_SIZE	13000
#endif

#ifdef FOREN6_FEEDER
    static const char Foren6Header[5] = {0xC1, 0x1F, 0xFE, 0x72, 0x01};
#endif

ADI_SPI_HANDLE  hDevice_SPI;

volatile bool sixlowpan_tx_in_progress = false;

#ifdef TELEC_TEST_HARNESS
#pragma location="never_retained_ram"
uint8_t heap[ BUFFER_POOL_SIZE ];

buf_mem_pool_t buf_cfg[2] = {
		{ 512, 5 },
                { 2500, 4 }
                            };
#endif

uint8_t ack_required;
uint8_t *direct_data_ptr;

/*----------------------------- Local Function Protos ---------------------------------*/

static void GetRadioSettings(ADI_ADF7023_GENERIC_SETTINGS_TYPE* settings);

/* Radio driver functions exported through Radio Driver Struct */
static int aducm3025_radio_init(void);
static int aducm3025_radio_prepare(const void *payload, unsigned short payload_len);
static int aducm3025_radio_transmit(unsigned short payload_len);
static int aducm3025_radio_send(const void *data, unsigned short len);
static int aducm3025_radio_read(void *buf, unsigned short bufsize);
static int aducm3025_radio_channel_clear(void);
static int aducm3025_radio_receiving_packet(void);
static int aducm3025_radio_pending_packet(void);
static int aducm3025_radio_on(void);
static int aducm3025_radio_off(void);

void Set_Ack_Done(uint8_t ack_done);
void Set_Rx_Seq_No(uint8_t seq_no);
void Set_Tx_Seq_No(uint8_t seq_no);
void Set_Ack_Required(uint8_t ack_req);

#ifdef DEBUG
static void PrintRadioSettings(ADI_ADF7023_DEV_HANDLE hUhf);
#endif // DEBUG

unsigned char adi_ADF7023_AsyncRx( void );

static uint16_t create_Normal_MR_FSK_PHR
(
bool scramble_psdu,
bool crc_16,
uint16_t* p_psdu_len
);

uint8_t ACK[] = {
  0x00,
  0x00,
  0x02,
  0x00,
  0x00,
  0x00,
  0x00,
  0X00,
  0X00
};

typedef struct TxStateMachine {
  uint8_t ACK_RX_Done;
  uint8_t Tx_Seq_No;
  uint8_t Rx_Seq_No;
  uint8_t Ack_Req;
}TxStateMachine_t;

volatile TxStateMachine_t TxState;

uint8_t bAckTxProgress = 0;

static int16_t rcvd_pkt_len;
ADI_ADF7023_RESULT_TYPE adi_ADF7023_SetPhyRx( ADI_ADF7023_DEV_HANDLE const );
uint8_t transmit_pwr = TRANSMIT_POWER;
uint16_t Ack_Missed = 0;

extern uint8_t rx_buf[ ADUCM3025_MAX_PACKET_LEN + SIZE_LEN_FIELD ];

extern rf_statistics_t rf_statistics;

extern phy_pib_t phy_pib;

extern int last_pkt_rcvd_rssi_val;

extern phy_mode_config_t* gp_phy_mode_config;
extern phy_band_config_t phy_band_config[];

uint32_t tx_packet_count, total_fail_count, cca_fail_count;
int32_t last_pkt_rcvd_lqi;

uint8_t *TRX_Get_RX_Buffer(void);

void phy_process_data_event( volatile uint8_t* p_trx_event );

/*---------------------------------------------------------------------------*/
PROCESS(aducm3025_radio_process, "ADucM3025 radio driver");
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/

static volatile uint8_t onoroff = OFF;
uint8_t DBG_Phy_State = 0x00;

static uint8_t aducm3025_txbuf[ ADUCM3025_MAX_PACKET_LEN + SIZE_LEN_FIELD + \
  SIZE_ADDR_FIELD + SIZE_CRC_FIELD ];

static uint8_t aducm3025_rxbuf[ ADUCM3025_MAX_PACKET_LEN + SIZE_LEN_FIELD + \
  SIZE_ADDR_FIELD + SIZE_CRC_FIELD ];

const struct radio_driver aducm3025_radio_driver =
{
  aducm3025_radio_init,
  aducm3025_radio_prepare,
  aducm3025_radio_transmit,
  aducm3025_radio_send,
  aducm3025_radio_read,
  aducm3025_radio_channel_clear,
  aducm3025_radio_receiving_packet,
  aducm3025_radio_pending_packet,
  aducm3025_radio_on,
  aducm3025_radio_off,
};

extern ADI_UART_HANDLE hUartDevice;

extern NodeType_t g_node_type;

