Kaveri-B/contiki/cpu/arm/aducm3029/dev/telec_dev/aducm3029-ADF7023.c
/*---------------------------------------------------------------------------*/
static int
aducm3025_radio_init(void)
{

  static const ADI_ADF7023_GENERIC_SETTINGS_TYPE ADF7023Configs = {
    /* Profile Number */
    PROFILE_NUM,
    /* ISM Band */
    ISMBAND_915MHZ,
    /* Frequency */
    901000000,
    /* Initialization Params*/
    INIT_TRSC_PORTS
  };

  enable_phy_trx(false);

#ifdef TELEC_TEST_HARNESS
  bm_init(  BUFFER_POOL_SIZE, heap, 2, buf_cfg );
#endif

#if TELEC_TEST_HARNESS
  rtc_config_init();
#endif

  ADI_ENABLE_INT(RADIO_INT_NUM);

  gp_phy_mode_config = &(phy_band_config[0].phy_mode_config[0]);

    /************TELEC INIT ***********************/
#if TELEC_TEST_HARNESS
  wakeup_GPIO_configure(true);
#endif

  /************TELEC INIT ENDS ***********************/

  /* Initialize ADF7023 radio. Pass the parameters which are obtained by GetRadioSettings.*/
  if(TRX_Init(hDevice_SPI, ADI_SPI_DEVID_2, SYS_GPIO_INTA_IRQn) != SUCCESS)
    return TRE_DEBUG;

  TRX_Register_Data_Event_cb(phy_process_data_event);

//  if ( ADF_RadioInit( ADF7023Configs.ProfileNo, ADF7023Configs.ISMBand,
//                     ADF7023Configs.Freq, ADF7023Configs.InitParm) != TRE_NO_ERR )
//    return TRE_DEBUG;

  /* Reduce the UHF interrupt priority */
  //  NVIC_SetPriority (SYS_GPIO_INTA_IRQn, 2);

  CLEAN_RXBUF();
  CLEAN_TXBUF();

  process_start(&aducm3025_radio_process, NULL);

  return 0;
}

/*---------------------------------------------------------------------------*/
int
radio_set_channel(unsigned long channelFrequency)
{
  return (TRX_Set_Channel_Frequency( channelFrequency ));
}
/*---------------------------------------------------------------------------*/

static int
aducm3025_radio_prepare(const void *payload, unsigned short payload_len)
{
  if (payload_len > (ADUCM3025_MAX_PACKET_LEN -
                     ( SIZE_LEN_FIELD + SIZE_CRC_FIELD))){
                       utu_timestamp(ADUCM3025_PKT_DROP_LEN_ISSUE,0);
                       return RADIO_TX_ERR;
                     }

#ifdef DISABLE_PATCH_802_15_4D
  aducm3025_txbuf[0] = payload_len + SIZE_LEN_FIELD + SIZE_CRC_FIELD ;

  /* Copy to the txbuf */
  memcpy(&aducm3025_txbuf[SIZE_LEN_FIELD], payload, payload_len);
#else
  /* Copy to the txbuf. First two bytes we are reserving to copy the PHR,so that we can eliminate the
  use of Radio_TRX_Buffer for transmission */
  memcpy(&aducm3025_txbuf[2], payload, payload_len);

#endif /* DISABLE_PATCH_802_15_4D */
  return RADIO_TX_OK;
}
/*---------------------------------------------------------------------------*/
static int
aducm3025_radio_transmit(unsigned short payload_len)
{
  uint8_t retry_counter = 0;

  utu_timestamp(ADUCM3025_PKT_TRANSMIT,0);
  while(MAC_MAX_ACK_RETRY > retry_counter)
  {
#ifndef DISABLE_PATCH_802_15_4D
    uint16_t PHR;
    uint8_t  Thrvalue = 37,TimerValue =4;

    PHR = create_Normal_MR_FSK_PHR
      (
       true, // bool scramble_psdu,
       !(I_SUPPORT_4BYTE_FCS), // bool crc_16,
       &payload_len // uint16_t* p_psdu_len
         );

#ifdef ENABLE_HARDWARE_CCA
    if(ADF7023_15d4g_Send_Pkt(PHR,aducm3025_txbuf,Thrvalue,TimerValue,true,transmit_pwr) == TRE_NO_ERR)
#else
      if(aducm3025_radio_channel_clear() != TRE_NO_ERR )
      {
        return RADIO_TX_COLLISION;
      }

    sixlowpan_tx_in_progress = true;

    if(TRX_Write(NULL, PHR,aducm3025_txbuf + 2, payload_len, false, Thrvalue,TimerValue) == SUCCESS)
#endif /* ENABLE_HARDWARE_CCA */
#else
      if( ADF_TransmitPacket( aducm3025_txbuf, transmit_pwr) == TRE_NO_ERR )
#endif // DISABLE_PATCH_802_15_4D
      {

        while(sixlowpan_tx_in_progress);

        if(TxState.Ack_Req)
        {
          int timeout = 100000;

          while(timeout)
          {
            if((TxState.ACK_RX_Done) && (TxState.Tx_Seq_No == TxState.Rx_Seq_No))
              return RADIO_TX_OK;

            timeout--;
          }
        }
        else
        {
          return RADIO_TX_OK;
        }
      }
    retry_counter++;
  }

  Ack_Missed++;

  return RADIO_TX_NOACK;
}
/*---------------------------------------------------------------------------*/
static int
aducm3025_radio_send(const void *payload, unsigned short payload_len)
{
  bAckTxProgress = 0;
  if(aducm3025_radio_prepare(payload, payload_len) == RADIO_TX_ERR){
    return RADIO_TX_ERR;
  }

#ifndef DISABLE_PATCH_802_15_4D
  /* Increment payload_len to accomodate crc */
  payload_len += SIZE_CRC_FIELD;
  return aducm3025_radio_transmit(payload_len);
#else
  /* For ADF7023: No need to pass Payload Length for aducm3025_radio_transmit */
  if ( aducm3025_radio_transmit(payload_len + SIZE_LEN_FIELD) == RADIO_TX_OK )
  {
    return RADIO_TX_OK;
  } else {
    return RADIO_TX_ERR;
  }
#endif /* DISABLE_PATCH_802_15_4D */
}

/*---------------------------------------------------------------------------*/
static int
aducm3025_radio_channel_clear(void)
{
    rf_statistics.RSSI_val = 0;
  if(TRX_Get_RSSI_Method_1 (&rf_statistics.RSSI_val) == SUCCESS ) {
    return ((rf_statistics.RSSI_val < -90)?TRE_NO_ERR:TRE_DEBUG);
  }

  return TRE_DEBUG;
}
/*---------------------------------------------------------------------------*/
static int
aducm3025_radio_receiving_packet(void)
{
  return 0;
}
/*---------------------------------------------------------------------------*/
static int
aducm3025_radio_pending_packet(void)
{
  /* ADucM3025 Transmit API is synchronous */
  return 0;
}
/*---------------------------------------------------------------------------*/
static int
aducm3025_radio_off(void)
{
  return TRX_Off( );
}
/*---------------------------------------------------------------------------*/
static int
aducm3025_radio_on(void)
{
#ifdef DISABLE_PATCH_802_15_4D
  return adi_ADF7023_SetPhyRx( );
#else
  DBG_Phy_State = 0x03;
  return TRX_Rx_15d4On( );
#endif // DISABLE_PATCH_802_15_4D
}

/*---------------------------------------------------------------------------*/

static int
aducm3025_radio_read(void *buf, unsigned short bufsize)
{
  if( RXBUF_EMPTY() || (aducm3025_rxbuf[0] > bufsize)){
    /*Nothing to read */ /* buffer too small */
    return 0;
  }

#ifdef DISABLE_PATCH_802_15_4D
  uint8_t len = aducm3025_rxbuf[0] - SIZE_LEN_FIELD - SIZE_CRC_FIELD;
#else
  uint8_t len = aducm3025_rxbuf[0] - SIZE_CRC_FIELD;
#endif // DISABLE_PATCH_802_15_4D

