Kaveri-B/contiki/cpu/arm/aducm3029/dev/telec_dev/aducm3029-ADF7023.c
  memcpy(buf, aducm3025_rxbuf+1, len);
  //  packetbuf_set_attr(PACKETBUF_ATTR_RSSI, rf_stats.RSSI_val);

  return len;
}

/*---------------------------------------------------------------------------*/
#ifdef INTERACTIVE_SETTINGS

#define ValidFreq(x)        (((x >= 431.0) && (x <= 464.0)) || ((x >= 862.0) && (x <= 928.0)))
#define ValidDataRate(x)    ((x >= 1.0) && (x <= 300.0))
#define ValidModScheme(x)   ((x >= MOD_2FSK) && (x <= MOD_2GFSK))

#define ASCII_0             '0'
#define ASCII_ESC           27

static char
ECHO(void)
{
  int16_t size_l = 1;
  char c;
  if( adi_UART_BufRx(hUartDevice, &c, &size_l) != ADI_UART_SUCCESS){
    return c;
  }
  if(adi_uart_SubmitTxBuffer(hUartDevice,&c,size_l) != ADI_UART_SUCCESS)
  {
    return c;
  }
  adi_uart_EnableTx(hUartDevice,true);

  return c;
}

static float
GetRadioOperatingFrequency(void)
{
  char rx_l[5] = {0};
  float ftemp = 0.0;
  char rx_char;
  int i = 0;

  do {
    i = 0;
    ftemp = 0;
    PRINTF("\nEnter basic settings for the radio. The 7023 will be configured to operate at the closest possible operating point.\n");
    PRINTF("\nEnter frequency in Mhz (Eg - For 905.52 Mhz enter 905.52): ");
    do {
      rx_char = ECHO();
      rx_l[i++] = rx_char;
    } while((uint8_t)rx_char != 0xD); /* check for enter key */

    ftemp = atof(rx_l);

    if( !ValidFreq(ftemp) ){
      PRINTF("\nPlease enter a valid frequency\nValid ranges are 431 - 464 Mhz or 862 - 928Mhz");
    }
    else {
      return ftemp;
    }
  } while(1);
}

static float
GetRadioOperatingDataRate(void)
{
  char rx_l[5] = {0};
  float ftemp = 0.0;
  char rx_char;
  int i = 0;

  do {
    i = 0;
    ftemp = 0;
    PRINTF("\n\nEnter data rate in kbps (Eg - For 38.5 kbps enter 38.5): ");
    do {
      rx_char = ECHO();
      rx_l[i++] = rx_char;
    } while((uint8_t)rx_char != 0xD); /* check for enter key */

    ftemp = atof(rx_l);

    if( !ValidDataRate(ftemp) ){
      PRINTF("\nInvalid data rate\nSupported rates are between 1 - 300 kbps");
    }
    else {
      return ftemp;
    }
  } while(1);
}

static char
GetRadioOperatingModulationScheme()
{
  char rx_char;

  do {
    PRINTF("\n\nEnter modulation scheme (Note - this sets both mod and demod schemes)  - \n 0 - FSK \n 1 - GFSK \nEnter choice: ");

    rx_char = ECHO() - ASCII_0;
    if( !ValidModScheme((uint8_t)rx_char) ){
      PRINTF("\n Invalid choice. Try again \n");
    }
    else {
      PRINTF("\n");
      return rx_char;
    }
  } while(1);
}

static void
GetRadioSettings(ADI_ADF7023_GENERIC_SETTINGS_TYPE* settings)
{
  float ftemp = 0.0;
  char rx_char;

  ftemp = GetRadioOperatingFrequency();
  settings->Frequency = (uint32_t)(ftemp * 1000000);

  ftemp = GetRadioOperatingDataRate();
  settings->DataRate = (uint16_t)(ftemp * 10);

  rx_char = GetRadioOperatingModulationScheme();
  settings->ModScheme = (ADI_ADF7023_MOD_TYPE)rx_char;
  settings->DemodScheme = (ADI_ADF7023_DEMOD_TYPE)rx_char;

  /* currently the radio address defaults to 0x1FF */
  settings->ShortAddr.ShortAddr = 0x1FF;
  settings->ShortAddr.ShortAddrMask = SHORT_ADDR_MASK;
}

#else

inline static void
GetRadioSettings(ADI_ADF7023_GENERIC_SETTINGS_TYPE* settings)
{
  // memcpy(settings, &ADF7023Configs, sizeof (ADI_ADF7023_GENERIC_SETTINGS_TYPE));
}

#endif // INTERACTIVE_SETTINGS

#ifdef DEBUG

static void
PrintRadioSettings(ADI_ADF7023_DEV_HANDLE hUhf)
{
  ADI_ADF7023_GENERIC_SETTINGS_TYPE settings;
  ADI_ADF7023_RESULT_TYPE result;
  ADI_ADF7023_PHY_STATE_TYPE phy_state;

  result = adi_ADF7023_GetGenericSettings(hUhf, &settings);

  if(!result){
    result = adi_ADF7023_GetPhyState(hUhf, &phy_state);
  }

  if(result != ADI_ADF7023_SUCCESS)	{
    while(1){
      ;   /* hang on failure here, will do for now */
    }
  }

  PRINTF("\nCurrent radio settings - \n");
  PRINTF("Frequency - %d Mhz\n", settings.Frequency);
  PRINTF("Data Rate - %d kbps\n", (settings.DataRate)/10);

  switch(settings.ModScheme) {
  case MOD_2FSK:
    PRINTF("Modulation and demodulation scheme - 2FSK\n");
    break;

  case MOD_2GFSK:
    PRINTF("Modulation and demodulation scheme - GFSK\n");
    break;

  case MOD_OOK:
    PRINTF("Modulation and demodulation scheme - OOK\n");
    break;

  default:
    PRINTF("Unknown modulation type - %d", settings.ModScheme);
    break;
  }

  switch(phy_state) {
  case PHY_OFF:
    PRINTF("Current phy state - Phy OFF\n");
    break;
  case PHY_ON:
    PRINTF("Current phy state - Phy ON\n");
    break;
  case PHY_TX:
    PRINTF("Current phy state - Phy TX\n");
    break;
  case PHY_RX:
    PRINTF("Current phy state - Phy RX\n");
    break;
  default:
    PRINTF("Unknown phy state - %d\n", phy_state);
  }
}

#endif // DEBUG

static uint16_t create_Normal_MR_FSK_PHR
(
bool scramble_psdu,
bool crc_16,
uint16_t* p_psdu_len
)
{

  uint16_t phr;

#ifndef DISABLE_PATCH_802_15_4D

  /* Set the length in the PHR */
  phr = (((*p_psdu_len & 0x00FF) << 8) | ((*p_psdu_len & 0xFF00) >> 8));

#else

  phr = *p_psdu_len;

  //phr(b15 to b5) = *p_psdu_len(b0 to b10)

  phr = (phr & 0x00FF) << 8 | (phr & 0xFF00) >> 8;
  phr = (phr & 0x0F0F) << 4 | (phr & 0xF0F0) >> 4;
  phr = (phr & 0x3333) << 2 | (phr & 0xCCCC) >> 2;
  phr = (phr & 0x5555) << 1 | (phr & 0xAAAA) >> 1;
#endif // DISABLE_PATCH_802_15_4D

  /*set the FCS len bit in the PHR*/
  phr |= ( crc_16 )?PHR_FCS_LEN_BIT_SET:PHR_FCS_LEN_BIT_RESET; //0 :32-bit, 1 :16 -bit

  /*set the Data whitening bit accordingly */
  phr |= ( scramble_psdu)?PHR_DATA_WHITENING_ENABLED:PHR_DATA_WHITENING_DISABLED;

  return phr;
}

unsigned char adi_ADF7023_AsyncRx( void )
{
  switch(mPHYState)
  {
  case CMD_PHY_SLEEP:
    if( TRX_Off( ) != SUCCESS )
      break;

    /* To go to PHY_RX from OFF state.we have to switch on the radio first */
  case CMD_PHY_OFF:
    if( TRX_On( ) != SUCCESS )
      break;

  case CMD_PHY_TX:
  case CMD_PHY_ON:
    if( TRX_Rx_On( ) != SUCCESS )
      break;

    return TRE_NO_ERR;

  default:
    break;
  }
  return TRE_DEBUG;
}

/*---------------------------------------------------------------------------*/
PROCESS_THREAD(aducm3025_radio_process, ev, data)
{
  int16_t len;

  PROCESS_BEGIN();

