Kaveri-B/contiki/cpu/arm/aducm3029/dev/telec_dev/aducm3029-ADF7023.c
  PRINTF_DEBUG("aducm3025_radio_process: started\r\n");

  while(1) {
#ifdef DISABLE_PATCH_802_15_4D
    /* Enable Async reception of RF frames */
    adi_ADF7023_AsyncRx( );
#endif /* DISABLE_PATCH_802_15_4D */

    PROCESS_YIELD_UNTIL(ev == PROCESS_EVENT_POLL);

    PRINTF_DEBUG("aducm3025_radio_process: calling receiver callback\r\n");

#ifdef DISABLE_PATCH_802_15_4D
    packetbuf_clear();
    len = aducm3025_radio_read(packetbuf_dataptr(), PACKETBUF_SIZE);
#else
    len = rcvd_pkt_len;
#endif // DISABLE_PATCH_802_15_4D

    if(len > 0) {

#ifdef WIRESHARK_FEEDER
      {
        extern ADI_UART_HANDLE hUartDevice;
        char i;
        int16_t j = 1;
        //len += 0;
        i = len;
#if(SLIPRADIO)
        slip_write(packetbuf_dataptr(), len);
#else
        if(ANode_GetAutoSend())
        {
          if(adi_uart_SubmitTxBuffer(hUartDevice,(char *)&i,j) == ADI_UART_SUCCESS)
            adi_uart_EnableTx(hUartDevice,true);

          if(adi_uart_SubmitTxBuffer(hUartDevice,(char *)packetbuf_dataptr(),len) == ADI_UART_SUCCESS)
            adi_uart_EnableTx(hUartDevice,true);

        }
#endif
      }
#elif FOREN6_FEEDER
      {
        extern ADI_UART_HANDLE hUartDevice;
        char i;
        int16_t j;
        //len += 0;
        i = len;
        //add it under a macro for foren6
        j =5;

        if(adi_uart_SubmitTxBuffer(hUartDevice,(char *)Foren6Header, j) == ADI_UART_SUCCESS)
          adi_uart_EnableTx(hUartDevice,true);
        //end of macro for foren6
        j = 1;
        if(adi_uart_SubmitTxBuffer(hUartDevice,(char *)&i, j) == ADI_UART_SUCCESS)
          adi_uart_EnableTx(hUartDevice,true);
        //len = len + 2;
        if(adi_uart_SubmitTxBuffer(hUartDevice,(char *)packetbuf_dataptr(),len) == ADI_UART_SUCCESS)
          adi_uart_EnableTx(hUartDevice,true);
      }
#else

#ifdef DEBUG
      {
        printf("\n********************************************************************************\n");
        char *ptr = packetbuf_dataptr();
        PRINTF_DEBUG("\nADURF101-radio:\n--------------\nReceived data len = %d bytes\n",len);
        printf("Received data:\n");

        for(u8_t c=0; c < len; c++){
          if(c%30 == 0 )
            printf("\n");
          PRINTF("%x:",ptr[c]);
        }

        PRINTF_DEBUG("\n");
      }
#endif	 //DEBUG

      packetbuf_set_datalen(len);
      NETSTACK_RDC.input();

#endif //WIRESHARK_FEEDER
    }
  }

  PROCESS_END();
}
/*---------------------------------------------------------------------------*/
volatile uint32_t dbg_rx_buff_overflow = 0;
void adi_ADF7023_ReceiveIsrCallback ( uint8_t *prxbuf )
{
  if(g_node_type != NODE_6LN){
    adi_gpio_Toggle(ADI_GPIO_PORT0,ADI_GPIO_PIN_13);
  }

#ifdef DISABLE_PATCH_802_15_4D
  /* Copy the received data into the receive buffer */
  memcpy( aducm3025_rxbuf, prxbuf, prxbuf[0] );
#else
  DBG_Phy_State = 0x02;
  uint16_t Rcv_Packet_Length = MAKE_UINT16(prxbuf[1],(prxbuf[0] & PHR_LENMSBMASK));

  /* Copy the received data into the receive buffer */
  memcpy( (aducm3025_rxbuf+1), (prxbuf+2), Rcv_Packet_Length);

  /* truncate 2 byte variable Rec_Packet_Length to 1 byte variable as we are sure that the upper sicslowpan layer can handle
  packets with length < 256 for the current implementation */
  aducm3025_rxbuf[0] = Rcv_Packet_Length;

  //  packetbuf_clear();

  if(aducm3025_rxbuf[1] & 0x02)
  {
    Set_Ack_Done(0x01);
    Set_Rx_Seq_No(aducm3025_rxbuf[3]);
  }

  rcvd_pkt_len = aducm3025_radio_read(packetbuf_dataptr(), PACKETBUF_SIZE);

#if defined(WIRESHARK_FEEDER) || defined(FOREN6_FEEDER)
  adi_ADF7023_Receive_15d4_Frame( );
#endif // WIRESHARK_FEEDER

#endif // DISABLE_PATCH_802_15_4D

  process_poll(&aducm3025_radio_process);
}

/*---------------------------------------------------------------------------*/

//void Poll_Radio_CB( void )
//{
//  /* Poll the aducm3025_radio process to process the received packet */
//  process_poll(&aducm3025_radio_process);
//}

/*---------------------------------------------------------------------------*/

extern void pull_down_gpio();
int send_ack(uint8_t seq_no, bool flag)
{
  uint16_t payload_len = 3;
  if(flag){
    ACK[2] |= (flag << 4);
  }
  else {
    ACK[2] = 0x02;
  }

  ACK[4] = seq_no;
  bAckTxProgress = 1;

  payload_len += SIZE_CRC_FIELD;

  pull_down_gpio();

#ifndef DISABLE_PATCH_802_15_4D
  uint16_t PHR;
  uint8_t  Thrvalue = 47,TimerValue =6;

  PHR = create_Normal_MR_FSK_PHR
    (
     true, // bool scramble_psdu,
     !(I_SUPPORT_4BYTE_FCS), // bool crc_16,
     &payload_len // uint16_t* p_psdu_len
       );

  sixlowpan_tx_in_progress = true;

  if(TRX_Write(NULL, PHR,ACK + 2, payload_len /* OR 4?? */, false, Thrvalue,TimerValue) == SUCCESS)
#else
    if( ADF_TransmitPacket( ACK, transmit_pwr) == TRE_NO_ERR )
#endif // DISABLE_PATCH_802_15_4D
    {
      while(sixlowpan_tx_in_progress);

      return RADIO_TX_OK;
    }

  return RADIO_TX_ERR;
}

void Set_Ack_Done(uint8_t ack_done)
{
  TxState.ACK_RX_Done = ack_done;
}

void Set_Rx_Seq_No(uint8_t seq_no)
{
  TxState.Rx_Seq_No = seq_no;
}

void Set_Tx_Seq_No(uint8_t seq_no)
{
  TxState.Tx_Seq_No = seq_no;
}

void Set_Ack_Required(uint8_t ack_req)
{
  TxState.Ack_Req = ack_req;
}

bool Get_Ack_Status()
{
  return((TxState.ACK_RX_Done) && (TxState.Tx_Seq_No == TxState.Rx_Seq_No));
}

void pull_up_gpio( )
{
#if 0
  adi_GPIO_ConfigurePinMuxing(ADI_GPIO_PORT_3, ADI_GPIO_P34);
  adi_GPIO_SetOutputEnable (ADI_GPIO_PORT_3, ADI_GPIO_PIN_4, true);
  adi_GPIO_SetOpenCircuitEnable (ADI_GPIO_PORT_3, ADI_GPIO_PIN_4, true);
  adi_GPIO_SetHigh (ADI_GPIO_PORT_3, ADI_GPIO_PIN_4);
#endif
}


void pull_down_gpio( )
{
#if 0
  adi_GPIO_ConfigurePinMuxing(ADI_GPIO_PORT_3, ADI_GPIO_P34);
  adi_GPIO_SetLow (ADI_GPIO_PORT_3, ADI_GPIO_PIN_4);
  adi_GPIO_SetOpenCircuitEnable (ADI_GPIO_PORT_3, ADI_GPIO_PIN_4, false);
#endif
}

void phy_process_data_event( volatile uint8_t* p_trx_event )
{
    uint16_t psdulen;
    phy_rx_t* p_rx_frame;
    uint8_t *pBuf;
    bool state_change_req;

    adi_int_EnterCriticalRegion();

    if( *p_trx_event & SFD_DETECTED )
    {

      *p_trx_event &= ~( SFD_DETECTED );

      /* Due to interrupt disabling while changing the TRX state,
      state might have been changed. Make sure TRX state in RX_ON
      state before changing the state BUSY_RX*/
      if (phy_pib.TRXState  == PHY_RX_ON)
      {

#ifdef STATISTICS_ENABLED
        rf_statistics.phy_sfd_detect_event++;
#endif//#ifdef STATISTICS_ENABLED

