Kaveri-B/contiki/cpu/arm/aducm3029/dev/telec_dev/aducm3029-ADF7023.c
#ifdef UTEST_PD
        utu_timestamp(UTUL_PHY_PROCESS_DATA_SYNC, 0);
#endif
        phy_pib.TRXState  = PHY_BUSY_RX;

        adi_int_ExitCriticalRegion();

        //sfd_detected_cb();

        adi_int_EnterCriticalRegion();
#ifndef PATCH_802_15_4D
        start_sports_reset_timer();
#else
        start_802_15_4D_rx_reset_timer();
      }
#endif
    }

    if( *p_trx_event & TX_COMPLETE )
    {
        *p_trx_event &= ~( TX_COMPLETE );
#ifdef STATISTICS_ENABLED
        rf_statistics.phy_tx_complete_event++;
#endif//#ifdef STATISTICS_ENABLED
#ifdef UTEST_PD
        utu_timestamp(UTUL_PHY_PROCESS_DATA_TX_PKT_DONE,0);
#endif

#ifdef	PATCH_802_15_4D
        phy_pib.TRXState  = PHY_DEV_ON;
#else
        phy_pib.TRXState  = PHY_TX_ON;
#endif

        adi_int_ExitCriticalRegion();

        stop_802_15_4D_reset_timer(3);

//        if( phy_pib.pendingStateChange != PHY_INVALID_PARAMETER )
//        {
//                /*check if there was any state transition which was waiting for transmission
//                to be completed. This takes care of setting TRX to PHY_RX_ON or PHY_TRX_OFF
//                state after making sure that the current transmission is completed */
//                PLME_Set_TRX_State( phy_pib.pendingStateChange );
//
//                phy_pib.pendingStateChange = PHY_INVALID_PARAMETER;
//        }

        PD_Data_Confirmation_cb( NULL, PHY_SUCCESS );

        adi_int_EnterCriticalRegion();
    }
    if ( *p_trx_event & RX_COMPLETE )
    {


#ifdef BENCH_MARKING

          benchMark_set_time(2);
#endif
          *p_trx_event &= ~( RX_COMPLETE );
#ifdef STATISTICS_ENABLED
          rf_statistics.phy_rx_complete_event++;
#endif//#ifdef STATISTICS_ENABLED

#ifdef UTEST_PD
	utu_timestamp(UTUL_PHY_PROCESS_DATA_RX_PKT_DONE, 0);
#endif

#ifdef PD_DEBUG
          phyProcDataEvent++;
#endif //#ifdef PD_DEBUG

          adi_int_ExitCriticalRegion();

#ifdef BENCH_MARKING

          benchMark_set_time(3);
#endif

#ifndef PATCH_802_15_4D
          stop_sports_reset_timer();
#else
          //stop_802_15_4D_rx_reset_timer();
#endif

#ifdef BENCH_MARKING

          benchMark_set_time(4);
#endif

          //TRX_On();		//change made

#ifdef BENCH_MARKING

          benchMark_set_time(5);
#endif

          phy_pib.TRXState = PHY_DEV_ON; //change made

          psdulen = TRX_get_RX_packet_len();

          /* allocate a buffer with only required size */
          pBuf = TRX_Get_RX_Buffer();

          TRX_clear_RX_Buffer();

          if (pBuf == NULL)
          {
                  PD_Data_Indication_cb( pBuf, false, PHY_CRC_ERROR );
                  return;
          }

          p_rx_frame = (phy_rx_t *)Get_phy_rx_struct_location(pBuf);

#ifdef BENCH_MARKING

          benchMark_set_time(6);
#endif
        if(phy_trx_enable_status())
        {
            TRX_Read_RX_Buffer( (uint8_t*)p_rx_frame, psdulen );
            p_rx_frame->psdu += 2;
            p_rx_frame->sfd_rx_time = hw_tmr_get_symbols( p_rx_frame->sfd_rx_time );
        }

#ifdef BENCH_MARKING

          benchMark_set_time(7);
#endif

          //TRX_Set_RX_Buffer();

#ifdef BENCH_MARKING

          benchMark_set_time(8);
#endif
          if(phy_trx_enable_status())
          {
              p_rx_frame->channel = phy_pib.CurrentChannel;

              last_pkt_rcvd_rssi_val = p_rx_frame->psduLinkQuality;

              p_rx_frame->psduLinkQuality  =
              convert_RSSI_To_LQI(p_rx_frame->psduLinkQuality);
          }

          if ( phy_pib.pendingStateChange != PHY_INVALID_PARAMETER )
          {
                  /*state transition to PHY_TRX_OFF is pending since the reception was under
                  progress. The required change is already done before reading the frame*/
                  phy_pib.pendingStateChange = PHY_INVALID_PARAMETER;
                  state_change_req = true;
          }
          else
          {
                  state_change_req = true;
          }

#ifdef TEMPERATURE_TEST

          uhf_result = (ADI_ADF7023_RESULT_TYPE)TRX_Read_Temperature(&tempReading);

          if(uhf_result != ADI_ADF7023_SUCCESS)
          {
                  TemperatureReadingErr++;
          }
          else
          {
                  TemperatureReadingSuccess++;
          }

#endif //TEMPERATURE_TEST

			//SetTestFlag(0,0);
#ifdef PATCH_802_15_4D

          /* if the 2 byte CRC used, then get the CRC status from lower layer */
          if ((TRX_crc_status() == false) /*&& (p_rx_frame->FCSLength == 2)*/)
          {
                  /* indicate higher layer about the packet reception with CRC error */
                  PD_Data_Indication_cb( pBuf, state_change_req, PHY_CRC_ERROR );
          }
          else
#endif
          {
                  /* Data received without CRC error(2 byte CRC).
                     For 4 byte CRC, the higher layer will verify about CRC failures */
                  PD_Data_Indication_cb( pBuf, state_change_req
#ifdef PATCH_802_15_4D
                  , PHY_SUCCESS
#endif

                  );
          }

          adi_int_EnterCriticalRegion();

        }

        adi_int_ExitCriticalRegion();
}


void PD_Data_Indication_cb( uint8_t *pBuf, bool state_change_req
#ifdef PATCH_802_15_4D
, u8 PHY_Status
#endif //PATCH_802_15_4D
)
{
    phy_rx_t *pdp;

    if(phy_trx_enable_status())
    {
#ifdef TELEC_TEST_HARNESS
        send_direct_pd_data_ind(pBuf, PHY_Status);
        if (!continuousRx_status())
        {
//            change_trx_state(&trxsm);
        }
        else
        {
            TRX_cont_Rx_15d4On();
        }
#endif
        return;
    }
    else
    {
        if(PHY_Status == PHY_CRC_ERROR)
        {
            TRX_Rx_15d4On();
            phy_pib.TRXState = PHY_RX_ON;
        }
        else
            adi_ADF7023_ReceiveIsrCallback ( rx_buf );
        return;
    }
}

#ifdef TELEC_TEST_HARNESS
void send_direct_pd_data_Telec_req(uint8_t CCA_Enable,uint16_t pd_data_len,uint8_t *pd_data,bool bUsePrevBuff)
{
  static phy_tx_t *phy_data;
  ulong temp = 0;
  uint16_t len;

