Kaveri-B/contiki/cpu/arm/aducm3029/dev/telec_dev/aducm3029-ADF7023.c
  uint8_t CCATimerDuration15D4;
  int8_t CCAThreshHold15D4 = -80;

  PLME_get_request( phyCurrentChannel, &len, &temp );

  if(!bUsePrevBuff)
  {
    phy_data = (phy_tx_t *)bm_alloc(heap, sizeof(phy_tx_t) + 10 + pd_data_len);

    phy_data->PPDUCoding = false;
    phy_data->ModeSwitch =	false;
    phy_data->NewModeSUNPage = 	0x00;
    phy_data->ModeSwitchParameterEntry = 0x00;
    phy_data->psduLength = pd_data_len;
    phy_data->FCSLength = false;
    phy_data->TxChannel = temp & 0xff;
    phy_data->psdu = (((uint8_t *)&phy_data->reservedPHR) + 2);
    memcpy(phy_data->psdu, pd_data, phy_data->psduLength);
  }

  if ( pd_data[0] & 0x20 )
  {
		ack_required = 1;
    }
    else
    {
    	ack_required = 0;
    }
	PLME_Set_TRX_State( PHY_DEV_ON );

  CCAThreshHold15D4 = CCA_THRESHOLD;

  if(!get_T108_limitation_mode())
     CCATimerDuration15D4 = 5;
  else
      CCATimerDuration15D4 = 0;

	PD_Data_Request( NULL, phy_data
#ifdef PATCH_802_15_4D
							,CCA_Enable,
							(CCAThreshHold15D4 + 107),
                                                        CCATimerDuration15D4
#endif
							);

	//free_buf_request( phy_data );
    direct_data_ptr = (uint8_t *)phy_data;
}
#endif

void PD_Data_Confirmation_cb( void* pHandle,uchar status )
{
    /* Testing direct pd data req */
    if(phy_trx_enable_status())
    {
#ifdef TELEC_TEST_HARNESS
//    tx_packet_count++;
      send_direct_pd_data_conf(direct_data_ptr, status);
      if (ack_required && (status == PHY_SUCCESS))
      {
          TRX_set_15D4_rx_buffer();
          phy_pib.TRXState = PHY_RX_ON;
      }
      ack_required = 0;
#endif
      return;
    }
    else
    {
      sixlowpan_tx_in_progress = false;
#ifdef DISABLE_PATCH_802_15_4D
      adi_ADF7023_AsyncRx( );
      return;
#else
      TRX_Rx_15d4On();
      phy_pib.TRXState = PHY_RX_ON;
      return;
#endif
    }
}

/**
 *******************************************************************************
 ** \brief This function allocates a buffer depending on frame control of the
 **			received packet.
 ** \param recv_buf - First few bytes received..
 **
 ** \retval - starting location of the allocated buffer.
 ******************************************************************************/
uint8_t *mac_allocate_rx_buffer(uint8_t *recv_buf)
{
    return rx_buf;
}
/**
 *******************************************************************************
 ** \brief This function gets the phy_rx_t structure location
 **		in the allocated buffer for reception.
 ** \param buf - Reception buffer allocated.
 **
 ** \retval - Location of phy_rx_t structure, in allocated buffer.
 ******************************************************************************/
uint8_t *mac_rx_struct_location(uint8_t *buf)
{
    return rx_buf;
}

/**
 *******************************************************************************
 ** \brief This function gets the location of data reception.
 **		in the allocated buffer for reception.
 ** \param buf - Reception buffer allocated.
 ** \param recv_buf - First few bytes received.
 **
 ** \retval - Location for data reception.
 ******************************************************************************/
uint8_t *Get_mac_Reception_location(uint8_t *buf, uint8_t *recv_data)
{
    return rx_buf;
}

/*---------------------------------------------------------------------------*/
